{"id":"33d36cc0-d8a9-11ed-a2bf-ab9fa9cc5e7f","updated_at":"2023-04-12T17:48:14.443Z","updated_by":"elastic","created_at":"2023-04-11T20:41:15.683Z","created_by":"elastic","name":"BP-SNL-0005 BioMetrics - Bad packet checksum","tags":[],"interval":"2m","enabled":true,"description":"Bad packet checksum","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"5m","kibana_siem_app_url":"http://10.5.54.21:5601/app/security"},"author":[],"false_positives":[],"from":"now-420s","rule_id":"a1a1a628-bee1-4f92-aced-ca13e577e8f2","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":6,"exceptions_list":[{"list_id":"7e8e8077-c83b-4e2d-880f-1fcaa2c76f5a","namespace_type":"single","id":"2a257e10-d8af-11ed-a2bf-ab9fa9cc5e7f","type":"detection"}],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"eql","language":"eql","index":["ecs-*"],"query":"any where message == \"bad_TCP_checksum\"","filters":[{"$state":{"store":"appState"},"meta":{"negate":false,"alias":null,"disabled":false,"type":"phrases","params":["10.5.54.226","10.5.54.227"],"value":["10.5.54.226","10.5.54.227"],"key":"destination.ip"},"query":{"bool":{"should":[{"match_phrase":{"destination.ip":"10.5.54.226"}},{"match_phrase":{"destination.ip":"10.5.54.227"}}],"minimum_should_match":1}}}],"throttle":"no_actions","actions":[]}
{"id":"2a3d3251-b17f-11ed-80c8-d713e841d538","updated_at":"2023-04-12T17:17:02.130Z","updated_by":"CSOC","created_at":"2023-02-21T00:32:04.602Z","created_by":"elastic","name":"BP-SNL-0003 IDS Alert - new communication between SRC and DST","tags":["blended-exercise"],"interval":"1m","enabled":false,"description":"New communications detected","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"800h","kibana_siem_app_url":"http://10.4.53.12:5601/app/security"},"author":[],"false_positives":[],"from":"now-2880060s","rule_id":"79d1f8cb-23c0-4e3f-9b1a-911ca86b5843","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":7,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["ecs-*"],"query":"(source.ip : \"10.5.54.230\" or source.ip : \"10.5.55.230\"  or source.ip : \"10.5.54.10\") and (destination.ip : \"10.5.55.127\" or destination.ip : \"10.5.55.128\")","filters":[],"throttle":"no_actions","actions":[]}
{"id":"19d256c0-b201-11ed-9475-436df6105a53","updated_at":"2023-04-13T17:41:50.487Z","updated_by":"elastic","created_at":"2023-02-21T16:02:12.028Z","created_by":"elastic","name":"BP-SNL-0002 new device detected on network","tags":[],"interval":"2m","enabled":true,"description":"BP-SNL-0002 new device detected on network","risk_score":49,"severity":"low","license":"","output_index":"","meta":{"from":"30m","kibana_siem_app_url":"http://10.5.54.21:5601/app/security"},"author":[],"false_positives":[],"from":"now-1920s","rule_id":"17036466-8877-4eba-84a4-3502ab49c505","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":10,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"new_terms","query":"(10.5.55.231 or 10.5.55.232) and (10.5.54.10 or 10.5.54.16 or 10.5.54.230)","new_terms_fields":["source.ip.keyword"],"history_window_start":"now-1h","index":["ecs-*"],"filters":[],"language":"kuery","throttle":"no_actions","actions":[]}
{"id":"1439a230-b207-11ed-9475-436df6105a53","updated_at":"2023-04-12T15:47:39.480Z","updated_by":"elastic","created_at":"2023-02-21T16:44:59.282Z","created_by":"elastic","name":"BP-SNL-0009 MimiKatz Execution detected","tags":[],"interval":"5m","enabled":false,"description":"BP-SNL-0009 MimiKatz Execution detected","risk_score":99,"severity":"critical","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://10.5.54.21:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"a3fd3385-e657-4e05-8ffe-112372b6fc30","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"91dec045-35fe-4e21-8b2a-4e8c6d145f6e","query":"mimikatz","filters":[],"throttle":"no_actions","actions":[]}
{"id":"f32903a0-b207-11ed-9475-436df6105a53","updated_at":"2023-04-12T15:47:36.100Z","updated_by":"elastic","created_at":"2023-02-21T16:51:13.605Z","created_by":"elastic","name":"BP-SNL-0007 Powershell Script Execution","tags":[],"interval":"5m","enabled":false,"description":"BP-SNL-0007 Powershell Script Execution","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://10.5.54.21:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"5dbd56ec-83e1-4fe4-855a-b48f0b54aead","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":2,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"91dec045-35fe-4e21-8b2a-4e8c6d145f6e","query":"process.parent.name: cmd.exe","filters":[],"throttle":"no_actions","actions":[]}
{"id":"312a4060-b186-11ed-80c8-d713e841d538","updated_at":"2023-04-13T17:31:57.069Z","updated_by":"elastic","created_at":"2023-02-21T01:22:22.776Z","created_by":"elastic","name":"BP-SNL-0001 Switch Port Up/Down","tags":[],"interval":"2m","enabled":true,"description":"A switch port came up or down.","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"5m","kibana_siem_app_url":"http://10.5.54.21:5601/app/security"},"author":[],"false_positives":[],"from":"now-420s","rule_id":"5802f67e-2d53-40fd-931c-c5b4d7b60aa0","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":5,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["ecs-cisco*"],"query":"message :\"LINK-UPDOWN\"","filters":[],"throttle":"no_actions","actions":[]}
{"_version":"WzIzNTY3OTMsN10=","created_at":"2023-04-11T21:23:55.632Z","created_by":"elastic","description":"test","id":"2a257e10-d8af-11ed-a2bf-ab9fa9cc5e7f","immutable":false,"list_id":"7e8e8077-c83b-4e2d-880f-1fcaa2c76f5a","name":"bad checksum EQL","namespace_type":"single","os_types":[],"tags":[],"tie_breaker_id":"a0269917-05af-4987-8bb1-42ed56e21305","type":"detection","updated_at":"2023-04-11T21:23:55.645Z","updated_by":"elastic","version":1}
{"exported_count":7,"exported_rules_count":6,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":1,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0}
